[
  {
    "Q": "Will I be charged With Holding Tax (WHT) on my investment?",
    "A": [
      "No. All interest payable are WHT free."
    ]
  },
  {
    "Q": "Is my deposit secured with Initiative Moni?",
    "A": [
      "Yes. It is a CBN regulated financial institution."
    ]
  },
  {
    "Q": "Can I run multiple investments on the app?",
    "A": [
      "Yes"
    ]
  },
  {
    "Q": "Can I get an investment advice for my investment?",
    "A": [
      "Yes"
    ]
  },
  {
    "Q": "Can I terminate my investment before maturity?",
    "A": [
      "Yes but there will be a penal charge."
    ]
  },
  {
    "Q": "Can I terminate part of investment?",
    "A": [
      "Yes but the investment must have lasted for 30 days."
    ]
  },
  {
    "Q": "Can I invest more than 5 million?",
    "A": [
      "Yes"
    ]
  },
  {
    "Q": "Is it possible to pay-off my loan before due date?",
    "A": [
      "Yes"
    ]
  },
  {
    "Q": "Can I get a loan more than N200,000 from the app?",
    "A": [
      "No but you can contact the help line."
    ]
  },
  {
    "Q": "How can I access other services?",
    "A": [
      "You have to contact our customer care representative."
    ]
  },
  {
    "Q": "Can I invest less than N50,000?",
    "A": [
      "No"
    ]
  },
  {
    "Q": "How much will be charged on my interest at maturity?",
    "A": [
      "Nothing"
    ]
  },
  {
    "Q": "Can I save my money on the app?",
    "A": [
      "No. Initiative Moni does not do savings but investment."
    ]
  },
  {
    "Q": "Is it compulsory to add my BVN?",
    "A": [
      "Yes"
    ]
  },
  {
    "Q": "Which phone number can I use on the app?",
    "A": [
      "The phone number linked with your BVN is advisable."
    ]
  },
  {
    "Q": "Is my BVN secured on the app?",
    "A": [
      "Yes"
    ]
  },
  {
    "Q": "Can I take a loan lower than N5,000?",
    "A": [
      "No"
    ]
  },
  {
    "Q": "How can I apply for a loan?",
    "A": [
      "On the home screen, click on get a loan and follow the procedure."
    ]
  },
  {
    "Q": "Can I increase my loan amount?",
    "A": [
      "No, once you completed your loan application, you cannot increase your loan."
    ]
  },
  {
    "Q": "How quickly can I get money into my bank account if approved?",
    "A": [
      "Funds are disbursed in less than 30 minutes."
    ]
  },
  {
    "Q": "Can I payoff my loan early?",
    "A": [
      "Yes. You can pay off your loan at any time prior to the date without a prepayment fee."
    ]
  },
  {
    "Q": "Can I deter a payment?",
    "A": [
      "No, you cannot."
    ]
  },
  {
    "Q": "Do I need to earn a minimum income in order to be approved a loan?",
    "A": [
      "We only require that applicants have sufficient income to repay their loan obligation."
    ]
  },
  {
    "Q": "How long will it take for my loan to be process?",
    "A": [
      "Loan is processed immediately you complete the loan application process  giving his/her accurate information to all compulsory requirements."
    ]
  },
  {
    "Q": "Why my application was/can is declined?",
    "A": [
      "Some of the names could include low credit score, wrong BVN, bad credit report, DSCR (Debt credit coverage ratio) above 33.33%. You can contact our helpline for more information."
    ]
  },
  {
    "Q": "Do you charge a late if I miss a loan payment?",
    "A": [
      "Yes"
    ]
  },
  {
    "Q": "What is the minimum I can invest?",
    "A": [
      "N50, 000"
    ]
  },
  {
    "Q": "How long can I invest for?",
    "A": [
      "1 – 12 months. If you wish to invest on maturity after your investment has been paid, it just takes a few clicks on your Initiative Moni app."
    ]
  },
  {
    "Q": "Can I top up an existing investment?",
    "A": [
      "Yes"
    ]
  },
  {
    "Q": "Is there any fee/charge to be paid to have an Initiative Moni investment account?",
    "A": [
      "No. There are no charges."
    ]
  },
  {
    "Q": "How do I monitor my investment?",
    "A": [
      "The application will always show you real time information on your earnings."
    ]
  },
  {
    "Q": "How is my protected?",
    "A": [
      "Your funds are safe as they are managed by Initiative Finance Limited (RC: 1112088) which is licensed and regulated by the Central Bank of Nigeria (CBN)."
    ]
  },
  {
    "Q": "What is a maturity date?",
    "A": [
      "This is a rainy day when your investment completes its agreed time period and you can receive your full principal and interest payment to your account."
    ]
  },
  {
    "Q": "What is Initiative Moni?",
    "A": [
      "Initiative Moni is Initiative Finance Limited’s mobile platform that helps you grow your wealth in a secure and transparent style."
    ]
  },
  {
    "Q": "How much interest do I get on my Initiative Moni investment?",
    "A": [
      "Rates vary depending on the investment duration selected.",
      "All interest payments are WHT free."
    ]
  }
]
